Revit 2026 API

# ProjectPositionEastWest Property

---

East/West offset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double EastWest { get; set; }
```
```vb
Public Property EastWest As Double
	Get
	Set
```
```cpp
public:
property double EastWest {
	double get ();
	void set (double value);
}
```
```fsharp
member EastWest : float with get, set
```

#### Property Value

Double

The offset of the project location from the site location in the east/west direction. Measured in decimal feet.

#### Reference

ProjectPosition Class

Autodesk.Revit.DB Namespace